{"backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "sequence_input", "config": {"batch_input_shape": [null, 700, 21], "sparse": false, "dtype": "float32", "name": "sequence_input"}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense_1", "config": {"activation": "relu", "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "units": 50}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"class_name": "InputLayer", "name": "profile_input", "config": {"batch_input_shape": [null, 700, 21], "sparse": false, "dtype": "float32", "name": "profile_input"}, "inbound_nodes": []}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["profile_input", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_67", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [1], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_67", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_67", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_67", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_67", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_67", "config": {"activation": "relu", "name": "activation_67", "trainable": true}, "inbound_nodes": [[["batch_normalization_67", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_67", "config": {"rate": 0.45, "name": "dropout_67", "trainable": true}, "inbound_nodes": [[["activation_67", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_64", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [1], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_64", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_68", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [11], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_68", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_67", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_64", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_64", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_64", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_68", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_68", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_68", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_64", "config": {"activation": "relu", "name": "activation_64", "trainable": true}, "inbound_nodes": [[["batch_normalization_64", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_68", "config": {"activation": "relu", "name": "activation_68", "trainable": true}, "inbound_nodes": [[["batch_normalization_68", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_64", "config": {"rate": 0.45, "name": "dropout_64", "trainable": true}, "inbound_nodes": [[["activation_64", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_68", "config": {"rate": 0.45, "name": "dropout_68", "trainable": true}, "inbound_nodes": [[["activation_68", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_62", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [1], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_62", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_65", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [7], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_65", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_64", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_69", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [11], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_69", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_68", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_62", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_62", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_62", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_65", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_65", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_65", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_69", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_69", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_69", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_62", "config": {"activation": "relu", "name": "activation_62", "trainable": true}, "inbound_nodes": [[["batch_normalization_62", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_65", "config": {"activation": "relu", "name": "activation_65", "trainable": true}, "inbound_nodes": [[["batch_normalization_65", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_69", "config": {"activation": "relu", "name": "activation_69", "trainable": true}, "inbound_nodes": [[["batch_normalization_69", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_62", "config": {"rate": 0.45, "name": "dropout_62", "trainable": true}, "inbound_nodes": [[["activation_62", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_65", "config": {"rate": 0.45, "name": "dropout_65", "trainable": true}, "inbound_nodes": [[["activation_65", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_69", "config": {"rate": 0.45, "name": "dropout_69", "trainable": true}, "inbound_nodes": [[["activation_69", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_61", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [1], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_61", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_63", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [3], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_63", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_62", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_66", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [7], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_66", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_65", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_70", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [11], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_70", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_69", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_61", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_61", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_61", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_63", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_63", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_63", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_66", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_66", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_66", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_70", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_70", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_70", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_61", "config": {"activation": "relu", "name": "activation_61", "trainable": true}, "inbound_nodes": [[["batch_normalization_61", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_63", "config": {"activation": "relu", "name": "activation_63", "trainable": true}, "inbound_nodes": [[["batch_normalization_63", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_66", "config": {"activation": "relu", "name": "activation_66", "trainable": true}, "inbound_nodes": [[["batch_normalization_66", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_70", "config": {"activation": "relu", "name": "activation_70", "trainable": true}, "inbound_nodes": [[["batch_normalization_70", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_61", "config": {"rate": 0.45, "name": "dropout_61", "trainable": true}, "inbound_nodes": [[["activation_61", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_63", "config": {"rate": 0.45, "name": "dropout_63", "trainable": true}, "inbound_nodes": [[["activation_63", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_66", "config": {"rate": 0.45, "name": "dropout_66", "trainable": true}, "inbound_nodes": [[["activation_66", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_70", "config": {"rate": 0.45, "name": "dropout_70", "trainable": true}, "inbound_nodes": [[["activation_70", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_8", "config": {"name": "concatenate_8", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_61", 0, 0, {}], ["dropout_63", 0, 0, {}], ["dropout_66", 0, 0, {}], ["dropout_70", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_77", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [1], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_77", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_37", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [1], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_37", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_77", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_77", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_77", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_37", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_37", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_37", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_77", "config": {"activation": "relu", "name": "activation_77", "trainable": true}, "inbound_nodes": [[["batch_normalization_77", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_37", "config": {"activation": "relu", "name": "activation_37", "trainable": true}, "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_77", "config": {"rate": 0.45, "name": "dropout_77", "trainable": true}, "inbound_nodes": [[["activation_77", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_37", "config": {"rate": 0.45, "name": "dropout_37", "trainable": true}, "inbound_nodes": [[["activation_37", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_74", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [1], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_74", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_78", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [11], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_78", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_77", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_34", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [1], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_34", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_38", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [11], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_38", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_37", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_74", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_74", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_74", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_78", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_78", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_78", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_34", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_34", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_34", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_38", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_38", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_38", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_74", "config": {"activation": "relu", "name": "activation_74", "trainable": true}, "inbound_nodes": [[["batch_normalization_74", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_78", "config": {"activation": "relu", "name": "activation_78", "trainable": true}, "inbound_nodes": [[["batch_normalization_78", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_34", "config": {"activation": "relu", "name": "activation_34", "trainable": true}, "inbound_nodes": [[["batch_normalization_34", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_38", "config": {"activation": "relu", "name": "activation_38", "trainable": true}, "inbound_nodes": [[["batch_normalization_38", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_74", "config": {"rate": 0.45, "name": "dropout_74", "trainable": true}, "inbound_nodes": [[["activation_74", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_78", "config": {"rate": 0.45, "name": "dropout_78", "trainable": true}, "inbound_nodes": [[["activation_78", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_34", "config": {"rate": 0.45, "name": "dropout_34", "trainable": true}, "inbound_nodes": [[["activation_34", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_38", "config": {"rate": 0.45, "name": "dropout_38", "trainable": true}, "inbound_nodes": [[["activation_38", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_72", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [1], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_72", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_75", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [7], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_75", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_74", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_79", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [11], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_79", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_78", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_32", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [1], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_32", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_35", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [7], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_35", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_34", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_39", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [11], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_39", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_38", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_72", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_72", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_72", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_75", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_75", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_75", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_79", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_79", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_79", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_32", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_32", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_32", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_35", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_35", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_39", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_39", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_39", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_72", "config": {"activation": "relu", "name": "activation_72", "trainable": true}, "inbound_nodes": [[["batch_normalization_72", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_75", "config": {"activation": "relu", "name": "activation_75", "trainable": true}, "inbound_nodes": [[["batch_normalization_75", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_79", "config": {"activation": "relu", "name": "activation_79", "trainable": true}, "inbound_nodes": [[["batch_normalization_79", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_32", "config": {"activation": "relu", "name": "activation_32", "trainable": true}, "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_35", "config": {"activation": "relu", "name": "activation_35", "trainable": true}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_39", "config": {"activation": "relu", "name": "activation_39", "trainable": true}, "inbound_nodes": [[["batch_normalization_39", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_72", "config": {"rate": 0.45, "name": "dropout_72", "trainable": true}, "inbound_nodes": [[["activation_72", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_75", "config": {"rate": 0.45, "name": "dropout_75", "trainable": true}, "inbound_nodes": [[["activation_75", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_79", "config": {"rate": 0.45, "name": "dropout_79", "trainable": true}, "inbound_nodes": [[["activation_79", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_32", "config": {"rate": 0.45, "name": "dropout_32", "trainable": true}, "inbound_nodes": [[["activation_32", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_35", "config": {"rate": 0.45, "name": "dropout_35", "trainable": true}, "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_39", "config": {"rate": 0.45, "name": "dropout_39", "trainable": true}, "inbound_nodes": [[["activation_39", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_71", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [1], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_71", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_73", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [3], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_73", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_72", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_76", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [7], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_76", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_75", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_80", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [11], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_80", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_79", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_31", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [1], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_31", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_33", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [3], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_33", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_32", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_36", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [7], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_36", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_35", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_40", "config": {"dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "kernel_size": [11], "trainable": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "conv1d_40", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1]}, "inbound_nodes": [[["dropout_39", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_71", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_71", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_71", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_73", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_73", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_73", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_76", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_76", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_76", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_80", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_80", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_80", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_31", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_31", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_31", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_33", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_33", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_33", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_36", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_36", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_36", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_40", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_40", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_40", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_71", "config": {"activation": "relu", "name": "activation_71", "trainable": true}, "inbound_nodes": [[["batch_normalization_71", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_73", "config": {"activation": "relu", "name": "activation_73", "trainable": true}, "inbound_nodes": [[["batch_normalization_73", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_76", "config": {"activation": "relu", "name": "activation_76", "trainable": true}, "inbound_nodes": [[["batch_normalization_76", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_80", "config": {"activation": "relu", "name": "activation_80", "trainable": true}, "inbound_nodes": [[["batch_normalization_80", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_31", "config": {"activation": "relu", "name": "activation_31", "trainable": true}, "inbound_nodes": [[["batch_normalization_31", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_33", 